app/views/clinics/index.html.erb

        <%end%>
        <td><%=clinic.examiners.size%></td>
---
SELECT COUNT(*) FROM "examiners"  WHERE "examiners"."clinic_id" = ?  [["clinic_id", 1]]