app/views/tasks/show.html.erb

SELECT  "profiles".* FROM "profiles"  WHERE "profiles"."user_id" = ? LIMIT 1  [["user_id", 3]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
---
  <strong>آزمون‌گیرنده:</strong>
  <%= @task.user.profile.first_name %>

SELECT  "patients".* FROM "patients"  WHERE "patients"."id" = ? LIMIT 1  [["id", 2]]
---
  <strong>نام:</strong>
  <%= @task.patient.first_name %>

SELECT  "stroops".* FROM "stroops"  WHERE "stroops"."task_id" = ?  ORDER BY "stroops"."id" DESC LIMIT 1  [["task_id", 2]]
---
  <strong>Stroop task before stimulation:</strong>
  <%if @task.stroops.first.finished %>