app/views/examiners/_form.html.erb

     <div class="patient_text">کلینیک:</div><br>
    <div class="wrap"><%= f.select :clinic_id, Clinic.all.collect {|x| [x.name, x.id]}, {}, :multiple => false %></div>
---
SELECT "clinics".* FROM "clinics"

     <div class="patient_text">انتخاب آزمون‌گیرنده:</div><br>
    <div class="wrap"><%= f.select :user_id, User.all.collect {|x| [x.profile.name , x.id]}, {}, :multiple => false %></div>
---
SELECT  "profiles".* FROM "profiles"  WHERE "profiles"."user_id" = ? LIMIT 1  [["user_id", 1]]
SELECT "users".* FROM "users"