app/controllers/clinics_controller.rb

  def index
    @clinics = Clinic.all
---
SELECT "clinics".* FROM "clinics"

  def create
    @clinic = Clinic.new(clinic_params)

    respond_to do |format|
      if @clinic.save
---
INSERT INTO "clinics" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-04-29 06:59:49.938877"], ["name", "اینکاس"], ["updated_at", "2015-04-29 06:59:49.938877"]]

  def update
    respond_to do |format|
      if @clinic.update(clinic_params)
---
UPDATE "clinics" SET "name" = ?, "updated_at" = ? WHERE "clinics"."id" = 1  [["name", "دانشگاه‌ تهران"], ["updated_at", "2015-05-22 10:20:31.721757"]]

    def set_clinic
      @clinic = Clinic.find(params[:id])
---
SELECT  "clinics".* FROM "clinics"  WHERE "clinics"."id" = ? LIMIT 1  [["id", 1]]