app/controllers/examiners_controller.rb

  def create
    @examiner = Examiner.new(examiner_params)
    if current_user.supervisor and !(@examiner.clinic.id ==current_user.supervisor.clinic.id)
      redirect_to root_url, :alert => "این عملیات امکان‌پذیر نیست."
      return
    end
    respond_to do |format|
      if @examiner.save
---
INSERT INTO "examiners" ("clinic_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["clinic_id", 1], ["created_at", "2015-04-29 07:00:56.861378"], ["updated_at", "2015-04-29 07:00:56.861378"], ["user_id", 3]]

  def destroy
    if current_user.supervisor and !(@examiner.clinic.id ==current_user.supervisor.clinic.id)
      redirect_to root_url, :alert => "این عملیات امکان‌پذیر نیست."
    end
    @clinic = @examiner.clinic
    @examiner.destroy
---
DELETE FROM "examiners" WHERE "examiners"."id" = ?  [["id", 1]]

    def set_examiner
      @examiner = Examiner.find(params[:id])
---
SELECT  "examiners".* FROM "examiners"  WHERE "examiners"."id" = ? LIMIT 1  [["id", 1]]