app/controllers/profiles_controller.rb

  def update
    respond_to do |format|
      if @profile.update(profile_params)
---
UPDATE "profiles" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "profiles"."id" = 3  [["first_name", "علی"], ["last_name", "نصرتی"], ["updated_at", "2015-04-29 07:00:25.658551"]]