app/controllers/regs_controller.rb

  def new
    @reg = Reg.new
    @patient = Patient.find_by_id(params[:patient_id])
---
SELECT  "patients".* FROM "patients"  WHERE "patients"."id" IS NULL LIMIT 1

  def create

    @reg = Reg.new(reg_params)
    @patient = @reg.patient
    if @patient
      @reg.clinic=current_user.supervisor.clinic
    else
      @patient = Patient.new
      @patient.first_name = params[:first_name]
      @patient.last_name = params[:last_name]

      @patient.save
      @reg.patient = @patient
      @reg.user = current_user
    end
    if (current_user.admin or current_user.manager) and !(Clinic.has_user(@reg.user,@reg.clinic.id) and Clinic.has_patient(@reg.patient,@reg.clinic.id))
      redirect_to root_url, :alert => "آزمون‌گیرنده یا آزمودنی، عضو این کلینیک نیستند."
      return
    end

    if current_user.supervisor and !(@reg.clinic.id == current_user.supervisor.clinic.id and Clinic.has_user(@reg.user,@reg.clinic.id) and Clinic.has_patient(@reg.patient,@reg.clinic.id) )
      redirect_to root_url, :alert => "این عملیات امکان‌پذیر نیست."
      return
    end


    if current_user.examiners.size>0 and !(@reg.user == current_user and User.has_clinic(@reg.clinic,current_user))
---
INSERT INTO "patients" ("created_at", "first_name", "last_name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-04-29 07:01:37.760558"], ["first_name", "نوید"], ["last_name", "صالح"], ["updated_at", "2015-04-29 07:01:37.760558"]]
INSERT INTO "regs" ("clinic_id", "created_at", "patient_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["clinic_id", 1], ["created_at", "2015-04-29 07:07:51.729174"], ["patient_id", 2], ["updated_at", "2015-04-29 07:07:51.729174"], ["user_id", 4]]
SELECT  "clinics".* FROM "clinics"  WHERE "clinics"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "supervisors".* FROM "supervisors"  WHERE "supervisors"."user_id" = ? LIMIT 1  [["user_id", 3]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = 3  ORDER BY "users"."id" ASC LIMIT 1
SELECT "examiners".* FROM "examiners"  WHERE "examiners"."clinic_id" = ?  [["clinic_id", 1]]

    def set_reg
      @reg = Reg.find(params[:id])
---
SELECT  "regs".* FROM "regs"  WHERE "regs"."id" = ? LIMIT 1  [["id", 0]]