app/controllers/stroops_controller.rb

  def index
    @stroops = Stroop.all
---
SELECT "stroops".* FROM "stroops"

  def create
    @stroop = Stroop.new(stroop_params)

    respond_to do |format|
      if @stroop.save
---
INSERT INTO "stroops" ("before_stimulation", "correct_items", "created_at", "duration", "task_id", "total_items", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["before_stimulation", "t"], ["correct_items", 2], ["created_at", "2015-04-29 07:36:43.815277"], ["duration", 4], ["task_id", 3], ["total_items", 5], ["updated_at", "2015-04-29 07:36:43.815277"]]

  def update
    @stroop.finished = true
    respond_to do |format|
      if @stroop.update(stroop_params)
---
UPDATE "stroops" SET "correct_items" = ?, "duration" = ?, "total_items" = ?, "updated_at" = ? WHERE "stroops"."id" = 3  [["correct_items", 1], ["duration", 3747], ["total_items", 3], ["updated_at", "2015-05-24 09:48:21.234574"]]

    def set_stroop
      @stroop = Stroop.find(params[:id])
---
SELECT  "stroops".* FROM "stroops"  WHERE "stroops"."id" = ? LIMIT 1  [["id", 3]]