app/controllers/supervisors_controller.rb

INSERT INTO "supervisors" ("clinic_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["clinic_id", 1], ["created_at", "2015-04-29 07:00:41.679890"], ["updated_at", "2015-04-29 07:00:41.679890"], ["user_id", 3]]
---
  def create
    @supervisor = Supervisor.new(supervisor_params)

    respond_to do |format|
      if @supervisor.save

SELECT  "supervisors".* FROM "supervisors"  WHERE "supervisors"."id" = ? LIMIT 1  [["id", 0]]
---
    def set_supervisor
      @supervisor = Supervisor.find(params[:id])