app/views/layouts/_navbar.html.erb

<!---------EXAMINER--------!-->
    <%if current_user.examiners.size>0%>
---
SELECT "examiners".* FROM "examiners"  WHERE "examiners"."user_id" = ?  [["user_id", 3]]
SELECT COUNT(*) FROM "examiners"  WHERE "examiners"."user_id" = ?  [["user_id", 1]]

<!--ALL-->
<%if current_user.admin or current_user.manager or current_user.supervisor or current_user.examiners.size>0%>
---
SELECT  "supervisors".* FROM "supervisors"  WHERE "supervisors"."user_id" = ? LIMIT 1  [["user_id", 1]]